package javaexp.z01_homework;

public class A1128 {
	/*[1단계:개념] 1. request객체가 가지고 있는 서버전송 정보 메서드의 기능에 대하여 출력하세요
	[1단계:확인] 2. 요청값 VO객체 예제로 조사자명과 선호하는 음식 종류, 평점 선택하게 하고, 결과를 서버에 저장하는 설문조사 페이지 만들기.
	[1단계:개념] 3. request.getParameterValues()가 일반 type="text"와 type="checkbox"일 때, 간단한 예제로 차이점을 기술하세요.
	[1단계:확인] 4. 아래 내용을 checkbox와 radio를 이용하여 요청값을 처리하여 결과를 출력하세요.
		1) 피자 주문 시스템: 사용자가 여러 토핑을 선택할 수 있는 체크박스를 사용하여 피자를 주문하는 JSP 페이지를 만드세요. 각 토핑은 추가 비용을 가지고 있으며, 최종 가격을 계산하여 보여줍니다.
		2) 설문 조사 양식: 다양한 주제에 대한 사용자의 선호도를 묻는 라디오 버튼 기반 설문 조사를 만드세요. 각 질문은 여러 선택지를 가지며, 사용자는 하나만 선택할 수 있습니다.
		3) 영화 장르 선택기: 사용자가 선호하는 영화 장르를 select박스로 멀티선택하고, 그에 따라 추천 영화 목록을 보여주는 페이지를 작성하세요.
	
	# 조별로 파악사항(아래사항 조별로 취합 전달 17:20까지 전달)
	1. 오늘 가장 어려웠던 부분 best3 및 내일 자세한 설명 필요한 부분
	2. 오늘 지각(9:00기준)/수업시간 엄수(매시간:00)/과제제출 인원과 사유
	3. 수업 시간 긍적적으로 집중하였는가?  */
}
